// https://swapi.dev – Працювати необхідно з цим API.
//     Інформацію про те, як влаштовано АПІ шукайте в документації!
//     Дуже заохочується максимально креативний підхід до цього завдання – робіть стилі, додайте який-небудь приємний шрифт
//     (Якщо зовсім туго з ідеями шрифтів візьміть Roboto с Google Fonts).
//
// 1.  Створіть кнопку: "отримати інформацію". При натисканні на неї отримайте та відобразіть інформацію про усіх
// персонажів 5 епізоду зоряних війн(films/2). Зверніть увагу, що необхідно вивчити документацію та на її основі вивести
// інформацію
// Виводимо тільки: повне ім'я персонажа, дата народження, стать(якщо зробите іконкою, буде взагалі ідеально).
// БОНУС ПЛЮС: Якщо додумаєтесь, як зберігати і виводити фотки персонажів – буде дуже круто.
// Я дам підказку: можна створити об'єкт з ключ=посилання_на_персонажа, значення=посилання_на_фотку
// У самому АПІ фотографій нмає, але ДЗшка стане набагато приємніше виглядати з зображеннями персонажів!
//
// 2.  Виведіть список усіх планет, які були у зоряних війнах.
//
// 3.  Додайте кнопку next, яка завантажить наступну сторінку зі списком планет. Попередня сторінка при цьому має пропасти.
// (відбувається заміна даних)
//
// 4.  ADVANCED: додайте до 1 завдання поле вводу з номером фільму(номер по порядку випуску фильму). Тепер при натисканні
// на кнопку – необхідно отримати інформацію не про 5тий епізод, а про фільм, номер якого вказано у полі вводу.
// Якщо вказана цифра 1 – потрібно передати запит на /films/1
//
// 5.  ADVANCED: Додайте кнопку перекладу на вукийську мову. Після натискання на кнопку – весь отриманий по апі контент
//     повинен перекластись на мову вуки.
//     Для цього достатньо додати до будь-якого запиту: ?format=wookiee.
//     При фантазії – можете ще і текст кнопок перекласти :)


axios.get('https://swapi.dev/api/films/2/')
    .then((res) => {
        const urlPeople = res.data.characters;

        urlPeople.map((p, i) => console.log(p));
    })
